<b>
It is a classification technique based on Bayes' Theorem with an assumption of independence among predictors. 
In simple terms, a Naive Bayes classifier assumes that
the presence of a particular feature in a class is unrelated to the presence of any other feature.</b>

Naive Bayes model is easy to build and particularly useful for very large data sets. Along with simplicity, 
Naive Bayes performs equally well as many common classifiers. Naive Bayes is a classification algorithm for 
binary (two-class) and multi-class classification problems. The technique is easiest to understand when
described using binary or categorical input values. However, Gaussian distribution can be used to find 
class- conditional probability for the continuous attributes.


It is called Naive Bayes because the calculation of the probabilities for each hypothesis is simplified to make their calculation easy. Rather than attempting to calculate the combined probability P(d1, d2, d3|h), attributes are assumed to be conditionally independent and the probability P(d1, d2, d3|h)is calculated as P(d1|h) * P(d2 h ) * P(d3|h).

In [137]:
import pandas as pd
import numpy as np

In [138]:
df=pd.read_csv("/Users/mayank/Downloads/Lab3-20221204/bank-data.csv")

In [139]:
df.head()

,id,age,sex,region,income,married,children,car,save_act,current_act,mortgage,pep
0,ID12101,48,FEMALE,INNER_CITY,17546.0,NO,1,NO,NO,NO,NO,YES
1,ID12102,40,MALE,TOWN,30085.1,YES,3,YES,NO,YES,YES,NO
2,ID12103,51,FEMALE,INNER_CITY,16575.4,YES,0,YES,YES,YES,NO,NO
3,ID12104,23,FEMALE,TOWN,20375.4,YES,3,NO,NO,YES,NO,NO
4,ID12105,57,FEMALE,RURAL,50576.3,YES,0,NO,YES,NO,NO,NO

In [140]:
df=df.drop('id',axis=1)

In [141]:
df.head()

,age,sex,region,income,married,children,car,save_act,current_act,mortgage,pep
0,48,FEMALE,INNER_CITY,17546.0,NO,1,NO,NO,NO,NO,YES
1,40,MALE,TOWN,30085.1,YES,3,YES,NO,YES,YES,NO
2,51,FEMALE,INNER_CITY,16575.4,YES,0,YES,YES,YES,NO,NO
3,23,FEMALE,TOWN,20375.4,YES,3,NO,NO,YES,NO,NO
4,57,FEMALE,RURAL,50576.3,YES,0,NO,YES,NO,NO,NO

In [142]:
from sklearn import preprocessing
le=preprocessing.LabelEncoder()
lis=['sex','region','married','car','save_act','current_act','mortgage','pep']
for i in lis:
    df[i]=le.fit_transform(df[i])

In [143]:
df.head()

,age,sex,region,income,married,children,car,save_act,current_act,mortgage,pep
0,48,0,0,17546.0,0,1,0,0,0,0,1
1,40,1,3,30085.1,1,3,1,0,1,1,0
2,51,0,0,16575.4,1,0,1,1,1,0,0
3,23,0,3,20375.4,1,3,0,0,1,0,0
4,57,0,1,50576.3,1,0,0,1,0,0,0

In [144]:
pd.qcut(df['income'], q=6)

0      (15132.333, 20406.033]
1        (24977.5, 31020.667]
2      (15132.333, 20406.033]
3      (15132.333, 20406.033]
4        (41230.933, 63130.1]
                ...
474      (20406.033, 24977.5]
475     (5014.209, 15132.333]
476      (24977.5, 31020.667]
477      (24977.5, 31020.667]
478      (20406.033, 24977.5]
Name: income, Length: 479, dtype: category
Categories (6, interval[float64, right]): [(5014.209, 15132.333] < (15132.333, 20406.033] < (20406.033, 24977.5] < (24977.5, 31020.667] < (31020.667, 41230.933] < (41230.933, 63130.1]]

In [145]:
df['income']=pd.cut(x=df['income'], bins=[5014,15132,20406,25977,31020,41230,63130], 
                        labels=[1, 2, 3,4,5,6])
print(df.head())

   age  sex  region income  married  children  car  save_act  current_act  \
0   48    0       0      2        0         1    0         0            0
1   40    1       3      4        1         3    1         0            1
2   51    0       0      2        1         0    1         1            1
3   23    0       3      2        1         3    0         0            1
4   57    0       1      6        1         0    0         1            0

   mortgage  pep
0         0    1
1         1    0
2         0    0
3         0    0
4         0    0

In [164]:
df.dtypes

age            category
sex               int64
region            int64
income         category
married           int64
children          int64
car               int64
save_act          int64
current_act       int64
mortgage          int64
pep               int64
dtype: object

In [147]:
pd.qcut(df['age'], q=5)

0        (47.0, 58.0]
1        (38.0, 47.0]
2        (47.0, 58.0]
3      (17.999, 27.0]
4        (47.0, 58.0]
            ...
474      (27.0, 38.0]
475      (27.0, 38.0]
476      (38.0, 47.0]
477      (38.0, 47.0]
478      (38.0, 47.0]
Name: age, Length: 479, dtype: category
Categories (5, interval[float64, right]): [(17.999, 27.0] < (27.0, 38.0] < (38.0, 47.0] < (47.0, 58.0] < (58.0, 67.0]]

In [148]:
df['age']=pd.cut(x=df['age'], bins=[17,27,38,47,58,67], 
                        labels=[1, 2, 3,4,5])
print(df.head())

  age  sex  region income  married  children  car  save_act  current_act  \
0   4    0       0      2        0         1    0         0            0
1   3    1       3      4        1         3    1         0            1
2   4    0       0      2        1         0    1         1            1
3   1    0       3      2        1         3    0         0            1
4   4    0       1      6        1         0    0         1            0

   mortgage  pep
0         0    1
1         1    0
2         0    0
3         0    0
4         0    0

In [149]:
df.dtypes

age            category
sex               int64
region            int64
income         category
married           int64
children          int64
car               int64
save_act          int64
current_act       int64
mortgage          int64
pep               int64
dtype: object

In [109]:
df.select_dtypes(include=['category']).astype('int')

     age
0      4
1      3
2      4
3      1
4      4
..   ...
474    2
475    2
476    3
477    3
478    3

[479 rows x 1 columns]

In [150]:
df.dtypes

age            category
sex               int64
region            int64
income         category
married           int64
children          int64
car               int64
save_act          int64
current_act       int64
mortgage          int64
pep               int64
dtype: object

In [111]:
c = df.select_dtypes(np.integer).columns
df['age'] = df['age'].astype('int')

In [151]:
df.dtypes

age            category
sex               int64
region            int64
income         category
married           int64
children          int64
car               int64
save_act          int64
current_act       int64
mortgage          int64
pep               int64
dtype: object

In [152]:
X=df[df.columns[:-1]]
Y=df[df.columns[-1:]]

In [153]:
X.head()

,age,sex,region,income,married,children,car,save_act,current_act,mortgage
0,4,0,0,2,0,1,0,0,0,0
1,3,1,3,4,1,3,1,0,1,1
2,4,0,0,2,1,0,1,1,1,0
3,1,0,3,2,1,3,0,0,1,0
4,4,0,1,6,1,0,0,1,0,0

In [154]:
Y.head()

   pep
0    1
1    0
2    0
3    0
4    0

In [155]:
from sklearn.model_selection import train_test_split
X_train,X_test,Y_train,Y_test=train_test_split(X,Y,random_state=30,test_size=0.2)

In [156]:
from sklearn.naive_bayes import CategoricalNB
gnb=CategoricalNB()
gnb.fit(X_train,Y_train)

/opt/anaconda3/lib/python3.9/site-packages/sklearn/utils/validation.py:1111: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

CategoricalNB()

In [157]:
df.age.unique()

[4, 3, 1, 2, 5]
Categories (5, int64): [1 < 2 < 3 < 4 < 5]

In [158]:
df.dtypes

age            category
sex               int64
region            int64
income         category
married           int64
children          int64
car               int64
save_act          int64
current_act       int64
mortgage          int64
pep               int64
dtype: object

In [159]:
predictions=gnb.predict(X_test)

In [160]:
from sklearn.metrics import classification_report,confusion_matrix 
from sklearn.metrics import accuracy_score
from sklearn.model_selection import cross_val_score

print (classification_report (Y_test, predictions))
print ("Confusion Matrix") 
print (confusion_matrix (Y_test, predictions))
print("\n Accuracy") 
print (accuracy_score (Y_test, predictions))

              precision    recall  f1-score   support

           0       0.69      0.71      0.70        51
           1       0.66      0.64      0.65        45

    accuracy                           0.68        96
   macro avg       0.68      0.68      0.68        96
weighted avg       0.68      0.68      0.68        96

Confusion Matrix
[[36 15]
 [16 29]]

 Accuracy
0.6770833333333334

<h3><b> I have all attributes to categorical values and later applied Categorial Naive Bayes. There is no package in  sklearn which uses both categorical and continuous attribute for naiove bayes. If there was some library we can use that and push age and income for numerical and others to categorical </b></h3>

In [166]:
X.corr() # No correlation is too high

,sex,region,married,children,car,save_act,current_act,mortgage
sex,1.000000,-0.025683,0.013560,-0.004089,0.061259,0.012936,-0.033821,0.070235
region,-0.025683,1.000000,-0.003875,0.029435,-0.004216,0.072585,0.013958,0.014856
married,0.013560,-0.003875,1.000000,-0.031679,-0.043234,0.049677,-0.038228,-0.001784
children,-0.004089,0.029435,-0.031679,1.000000,0.039704,0.013860,-0.032741,-0.047236
car,0.061259,-0.004216,-0.043234,0.039704,1.000000,0.011336,-0.034494,-0.005357
save_act,0.012936,0.072585,0.049677,0.013860,0.011336,1.000000,0.038640,0.013255
current_act,-0.033821,0.013958,-0.038228,-0.032741,-0.034494,0.038640,1.000000,-0.026433
mortgage,0.070235,0.014856,-0.001784,-0.047236,-0.005357,0.013255,-0.026433,1.000000